{
  "characters": [
    {
      "id": 1,
      "name": "Lue Kang",
      "imagesSmall": "https://cdn-mk1.mortalkombat.com/roster/liu-kang/thumb.webp",
      "imagesLarge": "https://cdn-mk1.mortalkombat.com/roster/liu-kang/hero.webp",
      "description": "Having won control of the Hourglass, Liu Kang restarted history. He neutralized the threats and dangers that had come before, crafting a New Era in which all beings would have the opportunity to find peace. But that peace is now threatened by an enemy that Liu Kang could never have anticipated. It will take all of his wisdom and experience to save not only Earthrealm, but all of reality.",
      "characteristic": "SECURITY",
      "voice": "",
      "animation": "",
      "style": "fire"
    },
    {
      "id": 2,
      "name": "Sub-Zero",
      "imagesSmall": "https://cdn-mk1.mortalkombat.com/roster/sub-zero/thumb.webp",
      "imagesLarge": "https://cdn-mk1.mortalkombat.com/roster/sub-zero/hero.webp",
      "description": "As the Lin Kuei's Grandmaster, Sub-Zero leads his ancient warrior clan in the defense of Earthrealm from external threats. For centuries, it has been their solemn task. But Earthrealm hasn’t been threatened in generations, and Sub-Zero sees no point in limiting his clan to preparing for dangers that may never come. Under his leadership, the Lin Kuei will come out of the shadows and fight for its place as one of Earthrealm’s great nations.",
      "characteristic": "POWER",
      "voice": "",
      "animation": "",
      "style": "frozen"
    },
    {
      "id": 3,
      "name": "Scorpion",
      "imagesSmall": "https://cdn-mk1.mortalkombat.com/roster/scorpion/thumb.webp",
      "imagesLarge": "https://cdn-mk1.mortalkombat.com/roster/scorpion/hero.webp",
      "description": "ALike his cherished father, Scorpion is dedicated to the Lin Kuei and its defense of Earthrealm. When his father died, Scorpion was bereft. Though he took pride in knowing that his brother, Sub-Zero, would succeed their father as the Lin Kuei's Grandmaster. But Sub-Zero's unprecedented moves to cast off the Lin Kuei's traditional duties have frozen Scorpion’s enthusiasm. He fears that he may one day have to battle his brother for control of the Lin Kuei's legacy.",
      "characteristic": "HONOR",
      "voice": "",
      "animation": "",
      "style": "fire"
    },
    {
      "id": 4,
      "name": "Kitana",
      "imagesSmall": "https://cdn-mk1.mortalkombat.com/roster/kitana/thumb.webp",
      "imagesLarge": "https://cdn-mk1.mortalkombat.com/roster/kitana/hero.webp",
      "description": "Kitana has one purpose in life: to aid and protect her older sister, Mileena, as she prepares to rule Outworld one day. The steady-handed Kitana ignores the calls of those who advocate that she should replace her impulsive sister as heir. Instead, Kitana will defend the realm by fighting to make Mileena the best Empress possible. She will also fight to hide the dark secret that could end her sister's reign before it begins.",
      "characteristic": "DUTY",
      "voice": "",
      "animation": "",
      "style": "hand-to-hand"
    },
    {
      "id": 5,
      "name": "Johnny Cage",
      "imagesSmall": "https://cdn-mk1.mortalkombat.com/roster/johnny-cage/thumb.webp",
      "imagesLarge": "https://cdn-mk1.mortalkombat.com/roster/johnny-cage/hero.webp",
      "description": "KLike many stars before him, Johnny became addicted to his fame. He came to measure his self-worth by his fans' adoration and their praise of him on social media. But with his star now fading, Johnny is fighting an uphill battle to remain relevant. He joins Liu Kang’s Earthrealm champions hoping that it will provide his career and his fame a desperately needed boost.",
      "characteristic": "VANITY",
      "voice": "",
      "animation": "",
      "style": "hand-to-hand"
    },
    {
      "id": 6,
      "name": "Kenshi Takahashi",
      "imagesSmall": "https://cdn-mk1.mortalkombat.com/roster/kenshi-takahashi/thumb.webp",
      "imagesLarge": "https://cdn-mk1.mortalkombat.com/roster/kenshi-takahashi/hero.webp",
      "description": "Once one of ancient Japan's most honored families, the Takahashis were decimated in battle. They lost everything, including the emblem of their power: the revered sword, Sento. Those who survived joined the Bakuto, a predecessor of the Yakuza, for its protection. Five centuries later, Kenshi is raised on the stories of his ancient family's exploits. Detesting his corrupt Yakuza life, he pines to free the Takahashis from the Yakuza's grasp and restore their name. But for his family to follow him, Kenshi must first fight to prove that he can lead. His first battle is to find and retrieve Sento.",
      "characteristic": "REVIVAL",
      "voice": "",
      "animation": "",
      "style": "hand-to-hand"
    },
    {
      "id": 7,
      "name": "Kung Lao",
      "imagesSmall": "https://cdn-mk1.mortalkombat.com/roster/kung-lao/thumb.webp",
      "imagesLarge": "https://cdn-mk1.mortalkombat.com/roster/kung-lao/hero.webp",
      "description": "Born and raised in the village of Fengjian, Kung Lao has spent his life toiling in the fields. It has been an honorable life, if not a glorious one. Kung Lao’s greatest fear is that his life will amount to nothing. He prays fervently that he will be called to do something bigger. His prayers are answered when he is asked to join the champions of Earthrealm. As a warrior fighting for its honor, Kung Lao knows that his victories will be long remembered.",
      "characteristic": "PRESTIGE",
      "voice": "",
      "animation": "",
      "style": "hand-to-hand"
    },
    {
      "id": 8,
      "name": "Mileena",
      "imagesSmall": "https://cdn-mk1.mortalkombat.com/roster/mileena/thumb.webp",
      "imagesLarge": "https://cdn-mk1.mortalkombat.com/roster/mileena/hero.webp",
      "description": "Born mere seconds ahead of her twin sister, Mileena is the rightful heir to Outworld’s throne. But even so, there are those who distrust Mileena’s impulsiveness. They whisper that Kitana, with her steadier hand, should replace Mileena as heir to the throne. As Mileena fights for legitimacy, she hides a horrible secret: she is infected with the dreaded and lethal Tarkat disease. Were her affliction found out, Mileena would be forced into battle to save her throne.",
      "characteristic": "PRESTIGE",
      "voice": "",
      "animation": "",
      "style": "hand-to-hand"
    },
    {
      "id": 9,
      "name": "Raiden",
      "imagesSmall": "https://cdn-mk1.mortalkombat.com/roster/raiden/thumb.webp",
      "imagesLarge": "https://cdn-mk1.mortalkombat.com/roster/raiden/hero.webp",
      "description": "In the village of Fengjian, Raiden was known for his kindness and his charity. He was happy to spend his days tending to the fields, as well as to his friends and family. So when he is asked to leave Fengjian and become one of Earthrealm’s champions, Raiden hesitates. But he soon realizes that to best serve his village, he must join them. As threats to Earthrealm mount, Raiden must mature into the great warrior that Liu Kang knows he can be.",
      "characteristic": "STABILITY",
      "voice": "",
      "animation": "",
      "style": "hand-to-hand"
    },
    {
      "id": 10,
      "name": "Rain",
      "imagesSmall": "https://cdn-mk1.mortalkombat.com/roster/rain/thumb.webp",
      "imagesLarge": "https://cdn-mk1.mortalkombat.com/roster/rain/hero.webp",
      "description": "As a student at Outworld’s exclusive Imperial Academy of Sorcery, Rain amazed his peers with his singular aptitude for water magic. Having honed his craft of water magic into a fierce weapon, he now hopes to learn the realms’ darkest and most powerful sorcery.",
      "characteristic": "AMBITION",
      "voice": "",
      "animation": "",
      "style": "hand-to-hand"
    },
    {
      "id": 11,
      "name": "Smoke",
      "imagesSmall": "https://cdn-mk1.mortalkombat.com/roster/smoke/thumb.webp",
      "imagesLarge": "https://cdn-mk1.mortalkombat.com/roster/smoke/hero.webp",
      "description": "As a boy, Smoke lived to hunt with his family. Their final hunt, however, ended in tragedy. Having accidentally trespassed onto Lin Kuei lands, they were attacked. Smoke was orphaned.Ashamed by his warriors' actions, the Lin Kuei's Grandmaster adopted Smoke. He raised him alongside his sons, Sub-Zero and Scorpion. Eventually, Smoke chose to make the Lin Kuei’s mission his own. But as he lacked his brothers' innate supernatural abilities, he set out to master practical magic. Having done so. he now joins them in Earthrealm's defense.",
      "characteristic": "LOYALTY",
      "voice": "",
      "animation": "",
      "style": "hand-to-hand"
    },
    {
      "id": 12,
      "name": "Li Mei",
      "imagesSmall": "https://cdn-mk1.mortalkombat.com/roster/li-mei/thumb.webp",
      "imagesLarge": "https://cdn-mk1.mortalkombat.com/roster/li-mei/hero.webp",
      "description": "As her parents’ firstborn daughter, Li Mei was claimed by the Umgadi, the warrior priestesses who guard Outworld’s royal family. Li Mei’s service began with high expectations. Her early success caught the eye of the Royal family. But it all fell apart when a terrible tragedy unfolded. Li Mei was blamed for this and In the aftermath, she did the unthinkable: she quit the Umgadi. Friendless and alone, Li Mei needed a new purpose. She joined Sun Do’s constables, the Outworld capital’s rough and tumble police force. Over time, she became their First Constable. Li Mei is glad to be the capital guardian. Still, she hopes one day to redeem herself.",
      "characteristic": "REDEMPTION",
      "voice": "",
      "animation": "",
      "style": "hand-to-hand"
    },
    {
      "id": 13,
      "name": "Baraka",
      "imagesSmall": "https://cdn-mk1.mortalkombat.com/roster/baraka/thumb.webp",
      "imagesLarge": "https://cdn-mk1.mortalkombat.com/roster/baraka/hero.webp",
      "description": "Baraka was once a respected Outworld merchant. But that life ended in an instant when he contracted the dreaded Tarkat plague. Incurable, contagious, and the cause of severe physical deformities, Tarkat turned Baraka into a monster. He was cast out and doomed to live out his days in a colony of similarly afflicted Outworlders. When Baraka first arrived, the colony was in disarray. His fellow Tarkatans had given up and were ready to die. Their hopelessness lit a fire in Baraka’s heart. He spares no effort to better his fellow Tarkatans’ lives. He knows that as long as he fights, he will never truly be a victim.",
      "characteristic": "PRESERVATION",
      "voice": "",
      "animation": "",
      "style": "hand-to-hand"
    },
    {
      "id": 14,
      "name": "Tanya",
      "imagesSmall": "https://cdn-mk1.mortalkombat.com/roster/tanya/thumb.webp",
      "imagesLarge": "https://cdn-mk1.mortalkombat.com/roster/tanya/hero.webp",
      "description": "Chosen as an infant from Outworld’s first-born daughters, Tanya was raised by the Umgadi’s priestesses. She’s never known her birth family. As she grew older and saw other initiates wash out, Tanya feared that she would share their fate. But that fear spurred success; after many attempts, Tanya passed her trials and became a full Umgadi. Over time, Tanya became one of the order’s most trusted members. She was the obvious choice when it needed to choose a new leader for the royal family’s personal guard. As an Umgadi, Tanya is sworn to piety and chastity. That is why her bond with Princess Mileena, were it known, would cause a scandal. By following her heart, Tanya risks not only her position but also her life.",
      "characteristic": "PROTECTION",
      "voice": "",
      "animation": "",
      "style": "hand-to-hand"
    },
    {
      "id": 15,
      "name": "Geras",
      "imagesSmall": "https://cdn-mk1.mortalkombat.com/roster/geras/thumb.webp",
      "imagesLarge": "https://cdn-mk1.mortalkombat.com/roster/geras/hero.webp",
      "description": "Reconstructed by Liu Kang at the dawn of his New Era, Geras remains eternal and unkillable. He retains the memories of all the innumerable timelines he has watched pass and fade. In this New Era, Geras monitors events to make sure that they are faithful to Liu Kang’s vision. When they deviate from their intended path, it is Geras’s responsibility to correct them. As threats begin to mount, Geras works tirelessly to defend reality. But to succeed, he must first identify the mastermind behind the plot to destroy Liu Kang’s New Era.",
      "characteristic": "SERVICE",
      "voice": "",
      "animation": "",
      "style": "hand-to-hand"
    },
    {
      "id": 16,
      "name": "Reptile",
      "imagesSmall": "https://cdn-mk1.mortalkombat.com/roster/reptile/thumb.webp",
      "imagesLarge": "https://cdn-mk1.mortalkombat.com/roster/reptile/hero.webp",
      "description": "Reconstructed by Liu Kang at the dawn of his New Era, Geras remains eternal and unkillable. He retains the memories of all the innumerable timelines he has watched pass and fade. In this New Era, Geras monitors events to make sure that they are faithful to Liu Kang’s vision. When they deviate from their intended path, it is Geras’s responsibility to correct them. As threats begin to mount, Geras works tirelessly to defend reality. But to succeed, he must first identify the mastermind behind the plot to destroy Liu Kang’s New Era.",
      "characteristic": "FREEDOM",
      "voice": "",
      "animation": "",
      "style": "hand-to-hand"
    },
    {
      "id": 17,
      "name": "AshrahAshrah",
      "imagesSmall": "https://cdn-mk1.mortalkombat.com/roster/ashrah/thumb.webp",
      "imagesLarge": "https://cdn-mk1.mortalkombat.com/roster/ashrah/hero.webp",
      "description": "As a demon, all Ashrah knew was pain and violence. She assumed all beings, in all realms, lived as she did. But once she journeyed outside of the Netherrealm, she realized her error. Other realms were places of beauty and peace. She could not aid in their defilement. Ashrah fled from her sister demons. Along the way, she found an enchanted kriss. It was a demon slayer, which she used to finish her pursuers. She was stunned to discover that using the kriss to destroy evil was purifying her soul. And that if she continued to do so, she could free herself from the Netherrealm.Ashrah senses that her final absolution is near. Once achieved, she will finally enter the light.",
      "characteristic": "ABSOLUTION",
      "voice": "",
      "animation": "",
      "style": "hand-to-hand"
    },
    {
      "id": 18,
      "name": "Sindel",
      "imagesSmall": "https://cdn-mk1.mortalkombat.com/roster/sindel/thumb.webp",
      "imagesLarge": "https://cdn-mk1.mortalkombat.com/roster/sindel/hero.webp",
      "description": "AWhen Sindel ascended to Outworld's throne, she worried that she was ill-prepared. Adding to her stress: her impending arranged marriage to Jerrod, an Outworld noble. Forced into it to placate a rebellious region, Sindel could only pray that he was worthy. To Sindel’s delight, Jerrod proved an ideal partner. Her early reign marked the start of a new Golden Age. Sindel then welcomed her beautiful twin daughters, Mileena and Kitana. She thanked the Gods for her charmed life. But Sindel had counted her blessings too quickly. When Jerrod was murdered, Sindel’s heart was broken. Smelling weakness, factions formed to challenge her rule. As her enemies conspire, Sindel fights to protect her family and her empire. She will do whatever it takes to defend her daughters’ birthright",
      "characteristic": "STABILITY",
      "voice": "",
      "animation": "",
      "style": "hand-to-hand"
    },
    {
      "id": 19,
      "name": "Nitara",
      "imagesSmall": "https://cdn-mk1.mortalkombat.com/roster/nitara/thumb.webp",
      "imagesLarge": "https://cdn-mk1.mortalkombat.com/roster/nitara/hero.webp",
      "description": "Nitara’s race of vampires hails from the dark and desolate realm of Vaeternus. To survive, they evolved the ability to feed on the blood of other creatures. The Vaeternians thrived, building a great society. But as their comfort grew, so did their shortsightedness. They overfed on Vaeternus’ creatures, disrupting the natural order. They now starve as it collapses. It is Nitara's solemn obligation to deliver her people from hunger and save her race. Vaeternus must survive.",
      "characteristic": "DELIVERANCE",
      "voice": "",
      "animation": "",
      "style": "hand-to-hand"
    },
    {
      "id": 20,
      "name": "Shang Tsung",
      "imagesSmall": "https://cdn-mk1.mortalkombat.com/roster/shang-tsung/thumb.webp",
      "imagesLarge": "https://cdn-mk1.mortalkombat.com/roster/shang-tsung/hero.webp",
      "description": "NShang Tsung grew up in Outworld’s backwaters. Too lazy for hard labor and too shifty for honest work, he eked out a living selling quack cures and fake magic. Though his wares were useless, Shang Tsung’s easy charm always closed the deal. Shang Tsung was resigned to this hardscrabble life. But then one day a mysterious stranger came, promising to make Shang Tsung a powerful sorcerer. Though suspicious of the offer, it was one he couldn’t refuse.",
      "characteristic": "INFLUENCE",
      "voice": "",
      "animation": "",
      "style": "hand-to-hand"
    },
    {
      "id": 21,
      "name": "Reiko",
      "imagesSmall": "https://cdn-mk1.mortalkombat.com/roster/reiko/thumb.webp",
      "imagesLarge": "https://cdn-mk1.mortalkombat.com/roster/reiko/hero.webp",
      "description": "Reiko was a boy when he and his family were captured during the Kafallah War. Though his family died, Reiko fought and survived. After spending months as a prisoner, Reiko was freed during a raid by General Shao. Despite his youth and small size, Reiko attacked his former captors and exacted bloody revenge. Impressed by the boy’s spirit, General Shao made Reiko his squire. Under his tutelage, Reiko learned the ways of war. He became an exceptional soldier and is now the General’s second-in-command. Reiko’s loyalty to General Shao is absolute. He will live and die by his orders.",
      "characteristic": "FEALTY",
      "voice": "",
      "animation": "",
      "style": "hand-to-hand"
    }
  ],
  "history": [
    {
      "id": 1,
      "logo": "https://www.mksecrets.net/images/mk1/mk1-logo01.jpg",
      "name": "Mortal Kombat 1992",
      "images": "https://upload.wikimedia.org/wikipedia/ru/thumb/4/47/Mortal_Kombat_SEGA_Genesis_Front.jpg/274px-Mortal_Kombat_SEGA_Genesis_Front.jpg",
      "description": "Mortal Kombat is a 1992 fighting game developed and published by Midway. It is the first entry in the Mortal Kombat series and was subsequently released by Acclaim Entertainment for nearly every home platform at that time. The game focuses on several characters of various intentions who enter a martial arts tournament with worldly consequences.",
      "data": 1992
    },
    {
      "id": 2,
      "logo": "https://media.vgm.io/products/13/10231/10231-1618004028.png",
      "name": "Mortal Kombat II",
      "images": "https://upload.wikimedia.org/wikipedia/en/d/df/Mortal_Kombat_II_boxart.png",
      "description": "Mortal Kombat II is a fighting game originally produced by Midway for the arcades in 1993. It was ported to multiple home systems, including MS-DOS, Amiga, Game Boy, Game Gear, Sega Genesis, 32X, Sega Saturn, Super Nintendo Entertainment System, and PlayStation only in Japan, mostly in licensed versions developed by Probe Software (later renamed to Probe Entertainment for some ports of the game) and Sculptured Software and published by Acclaim Entertainment (currently distributed by Warner Bros. Interactive Entertainment).",
      "data": 1993
    },
    {
      "id": 3,
      "logo": "https://images.launchbox-app.com/236f5204-648d-4980-97be-de84c9290372.png",
      "name": "Mortal Kombat 3",
      "images": "https://upload.wikimedia.org/wikipedia/en/9/9e/Mortal_Kombat_3_cover.JPG",
      "description": "Mortal Kombat 3 is a 1995 arcade fighting game developed by Midway Games and first released into arcades in 1995. It is the third main installment in the Mortal Kombat franchise and a sequel to 1993's Mortal Kombat II. As in the previous games, it has a cast of characters that players choose from and guide through a series of battles against other opponents. ",
      "data": 1995
    },
    {
      "id": 4,
      "logo": "https://cdn2.steamgriddb.com/file/sgdb-cdn/logo/57d8f002bbe76e1a04c9170788b0a85a.png",
      "name": "Mortal Kombat 4",
      "images": "https://upload.wikimedia.org/wikipedia/en/c/c2/Mortal_Kombat_4_cover.jpg",
      "description": "Mortal Kombat 4 is a 1997 fighting game, the fourth main installment in the Mortal Kombat franchise, and a sequel to 1995's Mortal Kombat 3. It was developed by Midway Games. Released to arcades in 1997, Mortal Kombat 4 is the first title in the series, and one of the first made by Midway overall, to use 3D computer graphics. It is also the last game of the series to have an arcade release. ",
      "data": 1997
    },
    {
      "id": 5,
      "logo": "https://media.vgm.io/products/83/10238/10238-1618041889.png",
      "name": "Mortal Kombat: Deadly Alliance",
      "images": "https://upload.wikimedia.org/wikipedia/en/2/20/MKDAcover.jpg",
      "description": "Mortal Kombat: Deadly Alliance is a 2002 fighting game developed and published by Midway for the Xbox, PlayStation 2, GameCube, and Game Boy Advance. It was the first all-new Mortal Kombat fighting game produced exclusively for home consoles, with no preceding arcade release. It is the fifth main installment in the Mortal Kombat franchise and a sequel to 1997's Mortal Kombat 4.",
      "data": 2002
    },
    {
      "id": 6,
      "logo": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Mkdeceptionlogo.png",
      "name": "Mortal Kombat: Deception",
      "images": "https://upload.wikimedia.org/wikipedia/en/f/f2/Mortal_Kombat_-_Deception_Coverart.png",
      "description": "Mortal Kombat: Deception is a 2004 fighting game developed and published by Midway. It is the sixth main installment in the Mortal Kombat franchise and a sequel to 2002's Mortal Kombat: Deadly Alliance. It was released for the PlayStation 2 and Xbox in October 2004, for the GameCube in March 2005 and later ported for the PlayStation Portable under the title Mortal Kombat: Unchained in November 2006. Mortal Kombat: Deception follows the storyline from the fifth installment.",
      "data": 2004
    },
    {
      "id": 7,
      "logo": "https://images.launchbox-app.com/b3daa1b9-4a5b-4a50-b4d4-da07cb4ea340.png",
      "name": "Mortal Kombat: Armageddon",
      "images": "https://upload.wikimedia.org/wikipedia/en/e/e2/MKAPS2.jpg",
      "description": "Mortal Kombat: Armageddon is a 2006 fighting game and it is the seventh main installment in the Mortal Kombat franchise and a sequel to 2004's Mortal Kombat: Deception. The PlayStation 2 and Xbox versions were released in October 2006, with a Wii version released on May 29, 2007 in North America. The Xbox version was not released in PAL territories.",
      "data": 2006
    },
    {
      "id": 8,
      "logo": "https://www.fdmk.net/gallery/encyclopedia/games/mkvsdc_logo.png",
      "name": "Mortal Kombat vs. DC Universe",
      "images": "https://upload.wikimedia.org/wikipedia/en/6/6b/Mortal_Kombat_vs._DC_Universe_Coverart.png",
      "description": "Mortal Kombat vs. DC Universe[a] is a 2008 fighting video game developed and published by Midway Games for the PlayStation 3 and Xbox 360. The game is a crossover between Mortal Kombat and the DC Universe, and is the eighth main installment in the Mortal Kombat franchise. The game was released on November 16, 2008.",
      "data": 2008
    },
    {
      "id": 9,
      "logo": "https://www.mksecrets.net/images/mk9/logo02.png",
      "name": "Mortal Kombat 2011",
      "images": "https://upload.wikimedia.org/wikipedia/en/1/1f/Mortal_Kombat_box_art.png",
      "description": "Mortal Kombat (also known as Mortal Kombat 9 (MK9)) is a 2011 fighting game developed by NetherRealm Studios and published by Warner Bros. Interactive Entertainment. It is the ninth main installment in the Mortal Kombat series and a soft reboot of the series. The game was released for the PlayStation 3 and Xbox 360 systems in April 2011.",
      "data": 2011
    },
    {
      "id": 10,
      "logo": "https://cdn2.steamgriddb.com/file/sgdb-cdn/logo_thumb/3820fccb250037463096208fe8a48618.png",
      "name": "Mortal Kombat X",
      "images": "https://upload.wikimedia.org/wikipedia/en/d/d0/Mortal_Kombat_X_Cover_Art.png",
      "description": "Mortal Kombat X[b] is a 2015 fighting game developed by NetherRealm Studios and published by Warner Bros. Interactive Entertainment for PlayStation 4, Windows, and Xbox One. Versions for the PlayStation 3 and Xbox 360 were also due to release, but both versions were cancelled. It is the tenth main installment in the Mortal Kombat series and a sequel to Mortal Kombat (2011), taking place 25 years later after the events of its predecessor. ",
      "data": 2015
    },
    {
      "id": 11,
      "logo": "https://www.lemonskystudios.com/wp-content/uploads/logo_2020_mortalcombat11.png",
      "name": "Mortal Kombat 11",
      "images": "https://upload.wikimedia.org/wikipedia/en/7/7e/Mortal_Kombat_11_cover_art.png",
      "description": "Mortal Kombat 11 is a 2019 fighting game developed by NetherRealm Studios and published by Warner Bros. Interactive Entertainment. It is the eleventh main installment in the Mortal Kombat series and a sequel to Mortal Kombat X (2015). The game was announced at The Game Awards 2018 and was released in North America and Europe on April 23, 2019.",
      "data": 2019
    },
    {
      "id": 12,
      "logo": "https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/5fbef0ad-821e-42ff-bd50-c54a0742abc7/dfxdf6z-74deba24-522d-418d-87d4-1e03bf4b20cb.png?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7InBhdGgiOiJcL2ZcLzVmYmVmMGFkLTgyMWUtNDJmZi1iZDUwLWM1NGEwNzQyYWJjN1wvZGZ4ZGY2ei03NGRlYmEyNC01MjJkLTQxOGQtODdkNC0xZTAzYmY0YjIwY2IucG5nIn1dXSwiYXVkIjpbInVybjpzZXJ2aWNlOmZpbGUuZG93bmxvYWQiXX0.7irtz-fBrcRQgWNo2mMYfAK5O1GoGOBjAriP8E0e66w",
      "name": "Mortal Kombat 1",
      "images": "https://upload.wikimedia.org/wikipedia/ru/f/f4/Mortal_Kombat_1_%282023%29_cover.jpeg",
      "description": "Mortal Kombat 1 is a 2023 fighting game developed by NetherRealm Studios and published by Warner Bros. Games. It is the twelfth main installment in the Mortal Kombat series, and serves as its second reboot after 2011's Mortal Kombat (2011). The game was released on Nintendo Switch, PlayStation 5, Windows, and Xbox Series X/S on September 19, 2023.",
      "data": 2023
    }
  ],
  "users": [
    {
      "email": "User1@gmail.com",
      "password": "$2a$10$o/YvTRq5Fy8lZT/6UAyYwuyF9bXz3OzFlJXX4KC6AxNrMk07FDcFW",
      "username": "User1",
      "id": 1,
      "firstname": "ergtgrtgrt"
    },
    {
      "email": "User2@gmail.com",
      "password": "$2a$10$cBAtXlppME62phd1Qrsvl.IiFPCBX/J7GUfgsy.JCI51ohC8Scb3O",
      "username": "User2",
      "id": 2
    },
    {
      "email": "sozoeva.alina@gmail.com",
      "password": "$2a$10$TVSxMP1TnIWCP2exa0wTyOAhWZH/.yJIhY3dMJvsTfiTjqdxINDe.",
      "username": "Alina Sozoeva",
      "id": 3,
      "firstname": "56h56h",
      "level": "",
      "lastname": "56h5"
    },
    {
      "email": "eg4h456hsozoeva.alina@gmail.com",
      "password": "$2a$10$zVb7/ASc5d0UH/I3vNLVne0W0YSLTGVZ6X27ZMh3EXnDagFUCZdSq",
      "username": "Alina Sozoeva",
      "id": 4
    },
    {
      "email": "s@gmail.com",
      "password": "$2a$10$OzDp/4OAi3w8.fVLx9yT1.Sax.7/0smnh4rW.TR71MV282bMQwJfu",
      "username": "Alina Sozoeva",
      "id": 5,
      "firstname": "45t54t4",
      "lastname": "4t45t4t",
      "number": "45t4yt45",
      "level": "449"
    }
  ],
  "comments": [],
  "news": [
    {
      "id": 1,
      "images": "https://cdn.wallpapersafari.com/30/35/42iMS0.jpg",
      "title": "Mortal Kombat 11: Unleashing the Power of Frost",
      "description": "Explore the chilling abilities of Frost in Mortal Kombat 11, as this cryomancer brings a new level of icy devastation to the roster of fighters. Delve into the world of Mortal Kombat esports, where top players compete in high-stakes tournaments, showcasing exceptional skill, mind games, and intense matchups.Mortal Kombat's influence extends beyond gaming into movies, animated series, and merchandise. The Mortal Kombat movie, with its intense fight choreography and faithful adaptation of the game's essence, has garnered a dedicated fan base.",
      "tag": "character"
    },
    {
      "id": 2,
      "images": "https://images.hdqwalls.com/wallpapers/2023-mortal-kombat-1-4k-4t.jpg",
      "title": "Mortal Kombat Movie: Behind the Scenes of the Epic Adaptation",
      "description": "Dive into the making of the Mortal Kombat movie, from the casting decisions to the intense fight choreography, capturing the essence of the beloved video game series. Beyond the gaming realm, Mortal Kombat has expanded its reach through various media. The Mortal Kombat movie, known for its impressive fight choreography and faithful adaptation of the game's essence, has garnered a dedicated fan base. Comic book series further delve into character backgrounds, weaving additional layers into the complex tapestry of the Mortal Kombat universe.",
      "tag": "news"
    },
    {
      "id": 3,
      "images": "https://e0.pxfuel.com/wallpapers/46/656/desktop-wallpaper-mortal-kombat-11-mortal-kombat-11-pc.jpg",
      "title": "Fatalities in Mortal Kombat: A Gruesome Tradition",
      "description": "Delve into the history of Fatalities, the signature finishing moves in Mortal Kombat, showcasing the most brutal and iconic ways to end a fight in the game. Esports has embraced Mortal Kombat, with competitive players engaging in high-stakes tournaments, showcasing skill, strategy, and intense matchups. The series has ventured into mobile gaming and virtual reality, ensuring that fans can experience the brutal combat on various platforms.",
      "tag": "gameplay"
    },
    {
      "id": 4,
      "title": "Mortal Kombat Tournaments: Rise to the Top",
      "images": "https://preview.redd.it/sub-zero-4k-wallpaper-photo-manipulation-made-by-me-v0-aqhqht7j3stb1.jpg?width=640&crop=smart&auto=webp&s=06ef8cf452d3a182dc1cda3828e668ccb0e05832",
      "description": "Witness the fierce competition of Mortal Kombat tournaments, where skilled players face off in intense battles to claim the title of the ultimate fighter. Mortal Kombat continues to captivate audiences worldwide, celebrating its legacy with crossovers, collector's editions, and events. As the franchise evolves, it remains a testament to the enduring appeal of immersive storytelling, dynamic characters, and, above all, the thrill of a well-executed Fatality.",
      "tag": "news"
    },
    {
      "id": 5,
      "images": "https://cdn.akamai.steamstatic.com/steam/apps/976310/ss_4fa4fd2ea1b7ff6c6b699dc9eb717986f80845a4.1920x1080.jpg?t=1691103008",
      "title": "Mortal Kombat Merchandise: Must-Have Items for Fans",
      "description": "Explore the world of Mortal Kombat merchandise, featuring a range of collectibles, clothing, and accessories that allow fans to showcase their love for the iconic franchise. The franchise's hallmark is its unique fighting style, blending martial arts with supernatural elements. Fatalities, the gruesome finishing moves, have become synonymous with Mortal Kombat, adding an element of shock and awe to the gameplay. Over the years, the game has introduced a diverse roster of characters, each with their own backstory and set of unique abilities.",
      "tag": "character"
    },
    {
      "id": 6,
      "images": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTbASAs2nOQnWwqTM70wD4ftuup4pU2X7SPWg&usqp=CAU",
      "title": "Mortal Kombat Mobile: Fighting on the Go",
      "description": "Experience Mortal Kombat on mobile devices, bringing the intense combat and iconic characters to the palm of your hand, with a focus on mobile-exclusive features and content. Mortal Kombat, a legendary fighting game franchise, has left an indelible mark on the gaming industry since its debut in 1992. Known for its visceral combat, intricate storylines, and iconic characters, Mortal Kombat has evolved into a cultural phenomenon.",
      "tag": "character"
    },
    {
      "id": 7,
      "images": "https://wallpaperaccess.com/full/2254207.jpg",
      "title": "Mortal Kombat Comics: Expanding the Universe",
      "description": "Dive into the Mortal Kombat comic book series, where the rich lore of the game is expanded upon, featuring new storylines, characters, and unexpected twists. Mortal Kombat continues to captivate audiences worldwide, celebrating its legacy with crossovers, collector's editions, and events. As the franchise evolves, it remains a testament to the enduring appeal of immersive storytelling, dynamic characters, and, above all, the thrill of a well-executed Fatality.",
      "tag": "news"
    },
    {
      "id": 8,
      "images": "hhttps://wallpaperset.com/w/full/6/7/7/500274.jpg",
      "title": "Mortal Kombat Soundtrack: The Beat of Battle",
      "description": "Immerse yourself in the sounds of Mortal Kombat, exploring the iconic soundtrack that enhances the intensity of the fights and contributes to the overall atmosphere of the game.",
      "tag": "news"
    },
    {
      "id": 9,
      "images": "https://preview.redd.it/sub-zero-4k-wallpaper-photo-manipulation-made-by-me-v0-aqhqht7j3stb1.jpg?width=640&crop=smart&auto=webp&s=06ef8cf452d3a182dc1cda3828e668ccb0e05832",
      "title": "Mortal Kombat Legacy: Retelling the Story",
      "description": "Discover Mortal Kombat Legacy, a web series that explores the backstories of iconic characters, providing a fresh perspective on the events of the Mortal Kombat universe.",
      "tag": "character"
    },
    {
      "id": 10,
      "images": "https://cdn.wallpapersafari.com/30/35/42iMS0.jpg",
      "title": "Mortal Kombat Secrets: Easter Eggs and Hidden Gems",
      "description": "Uncover the secrets of Mortal Kombat, from hidden Easter eggs within the games to obscure references and details that only the most dedicated fans can spot.",
      "tag": "news"
    },
    {
      "id": 11,
      "images": "https://cdn.akamai.steamstatic.com/steam/apps/976310/ss_ecddafdaee86bfb66b0a7290dda445f43195b48d.1920x1080.jpg?t=1691103008",
      "title": "Mortal Kombat Characters: Iconic Fighters Through the Ages",
      "description": "Take a journey through the history of Mortal Kombat characters, from the original lineup to the diverse and dynamic roster of fighters in the latest releases.",
      "tag": "characters"
    },
    {
      "id": 12,
      "images": "https://cdn.wallpapersafari.com/30/35/42iMS0.jpg",
      "title": "Mortal Kombat Cosplay: Bringing Characters to Life",
      "description": "Witness the creativity and skill of Mortal Kombat fans as they bring their favorite characters to life through stunning cosplay, showcasing intricate costumes and attention to detail.",
      "tag": "news"
    },
    {
      "id": 13,
      "images": "https://e0.pxfuel.com/wallpapers/247/22/desktop-wallpaper-mortal-combat-mortal-kombat-1.jpg",
      "title": "Mortal Kombat Esports: Competitive Fighting at Its Peak",
      "description": "Delve into the world of Mortal Kombat esports, where top players compete in high-stakes tournaments, showcasing exceptional skill, mind games, and intense matchups.",
      "tag": "character"
    },
    {
      "id": 14,
      "images": "https://edge.mwallpapers.com/photos/celebrities/artist/scorpion-and-sub-zero-mortal-kombat-android-iphone-hd-wallpaper-background-downloadhd-wallpapers-desktop-background-android-iphone-1080p-4k-dtnam.jpg",
      "title": "Mortal Kombat: The Art of Character Design",
      "description": "Explore the artistic process behind designing iconic Mortal Kombat characters, from initial concept sketches to fully realized 3D models, highlighting the creative vision of the developers.",
      "tag": "news"
    },
    {
      "id": 15,
      "images": "https://wallpaper-house.com/data/out/8/wallpaper2you_276848.jpg",
      "title": "Mortal Kombat VR: Immersive Virtual Reality Battles",
      "description": "Step into the virtual realm with Mortal Kombat VR, offering an immersive and visceral fighting experience that brings the brutal combat of the series to a new level of realism.",
      "tag": "gameplay"
    },
    {
      "id": 16,
      "images": "https://wallpaperaccess.com/full/4977878.jpg",
      "title": "Mortal Kombat Lore: Mythology and Mysteries Unveiled",
      "description": "Unravel the mythology and mysterious elements of the Mortal Kombat universe, exploring ancient prophecies, divine realms, and the intricate connections between characters.",
      "tag": "gameplay"
    },
    {
      "id": 17,
      "images": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR0aK1_95OWqO3NieO23dMJU09hVwi3qSV_WQ&usqp=CAU",
      "title": "Mortal Kombat Animations: From Games to Animated Features",
      "description": "Experience Mortal Kombat in animated form, from in-game character animations to full-length animated features that bring the intense action and storytelling to a new medium.",
      "tag": "animation"
    },
    {
      "id": 18,
      "images": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSMslEzQ2V3ajSvsoVI9aCHhRigNj_xjNKhKQ&usqp=CAU",
      "title": "Mortal Kombat Music: Composing the Perfect Fight",
      "description": "Dive into the world of composing music for Mortal Kombat, where the right soundtrack enhances the atmosphere of battles, intensifying the player's connection to the game.",
      "tag": "animation"
    },
    {
      "id": 19,
      "images": "https://wallpapercave.com/wp/wp4049455.jpg",
      "title": "Mortal Kombat Crossovers: Unexpected Collaborations",
      "description": "Discover unexpected crossovers featuring Mortal Kombat characters, from guest appearances in other games to unique collaborations that expand the universe of these iconic fighters.",
      "tag": "gameplay"
    },
    {
      "id": 20,
      "images": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT4amBtz6tApvUn_Pe2F5ogmyf3ebpkntN0lQ&usqp=CAU",
      "title": "Mortal Kombat Collectors' Editions: Beyond the Standard Release",
      "description": "Explore the world of Mortal Kombat collectors' editions, featuring exclusive content, physical collectibles, and unique packaging that caters to dedicated fans and collectors.",
      "tag": "collectibles"
    },
    {
      "id": 21,
      "images": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQVTkMWgoCouG2tt4k1D3ejBnqzcgmw0KHSfg&usqp=CAU",
      "title": "Mortal Kombat Cosplay: Bringing Characters to Life",
      "description": "Witness the creativity and skill of Mortal Kombat fans as they bring their favorite characters to life through stunning cosplay, showcasing intricate costumes and attention to detail.",
      "tag": "animation"
    },
    {
      "id": 22,
      "images": "https://c4.wallpaperflare.com/wallpaper/830/907/734/video-game-art-video-games-mortal-kombat-rain-mortal-kombat-wallpaper-preview.jpg",
      "title": "Mortal Kombat Esports: Competitive Fighting at Its Peak",
      "description": "Delve into the world of Mortal Kombat esports, where top players compete in high-stakes tournaments, showcasing exceptional skill, mind games, and intense matchups.",
      "tag": "animation"
    },
    {
      "id": 23,
      "images": "https://wallpaperset.com/w/full/d/6/6/500285.jpg",
      "title": "Mortal Kombat: The Art of Character Design",
      "description": "Explore the artistic process behind designing iconic Mortal Kombat characters, from initial concept sketches to fully realized 3D models, highlighting the creative vision of the developers.",
      "tag": "animation"
    },
    {
      "id": 24,
      "images": "https://cdn.wallpapersafari.com/30/35/42iMS0.jpg",
      "title": "Mortal Kombat VR: Immersive Virtual Reality Battles",
      "description": "Step into the virtual realm with Mortal Kombat VR, offering an immersive and visceral fighting experience that brings the brutal combat of the series to a new level of realism.",
      "tag": "gameplay"
    },
    {
      "id": 25,
      "images": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRPpYy65u9z6MIwwXxZECeDm9Yzm7pg06D8NHIeaiAriW4zD09XcaOR2IbgH4dU9d7hno4&usqp=CAU",
      "title": "Mortal Kombat Lore: Mythology and Mysteries Unveiled",
      "description": "Unravel the mythology and mysterious elements of the Mortal Kombat universe, exploring ancient prophecies, divine realms, and the intricate connections between characters.",
      "tag": "animation"
    },
    {
      "id": 26,
      "images": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRPpYy65u9z6MIwwXxZECeDm9Yzm7pg06D8NHIeaiAriW4zD09XcaOR2IbgH4dU9d7hno4&usqp=CAU",
      "title": "Mortal Kombat Animations: From Games to Animated Features",
      "description": "Experience Mortal Kombat in animated form, from in-game character animations to full-length animated features that bring the intense action and storytelling to a new medium.",
      "tag": "gameplay"
    },
    {
      "id": 27,
      "images": "https://cdn.wallpapersafari.com/30/35/42iMS0.jpg",
      "title": "Mortal Kombat Music: Composing the Perfect Fight",
      "description": "Immerse yourself in the sounds of Mortal Kombat, exploring the iconic soundtrack that enhances the intensity of the fights and contributes to the overall atmosphere of the game.",
      "tag": "news"
    },
    {
      "id": 28,
      "images": "https://images.hdqwalls.com/wallpapers/2023-mortal-kombat-1-4k-4t.jpg",
      "title": "Mortal Kombat Crossovers: Unexpected Collaborations",
      "description": "Discover unexpected crossovers featuring Mortal Kombat characters, from guest appearances in other games to unique collaborations that expand the universe of these iconic fighters.",
      "tag": "animation"
    },
    {
      "id": 29,
      "images": "https://preview.redd.it/sub-zero-4k-wallpaper-photo-manipulation-made-by-me-v0-aqhqht7j3stb1.jpg?width=640&crop=smart&auto=webp&s=06ef8cf452d3a182dc1cda3828e668ccb0e05832",
      "title": "Mortal Kombat Collectors' Editions: Beyond the Standard Release",
      "description": "Explore the world of Mortal Kombat collectors' editions, featuring exclusive content, physical collectibles, and unique packaging that caters to dedicated fans and collectors.",
      "tag": "news"
    },
    {
      "id": 30,
      "images": "https://images.hdqwalls.com/wallpapers/2023-mortal-kombat-1-4k-4t.jpg",
      "title": "Mortal Kombat: The Evolution of Female Characters",
      "description": "Celebrate the evolution of female characters in Mortal Kombat, from their initial appearances to the empowering and diverse roster of fighters in the latest iterations of the series.",
      "tag": "characters"
    }
  ]
}
